precmd () { echo -n "\x1b]1337;CurrentDir=$(pwd)\x07" }

# 启用 P10K 的即时提示
if [[ -r "${XDG_CACHE_HOME:-$HOME/.cache}/p10k-instant-prompt-${(%):-%n}.zsh" ]]; then
    source "${XDG_CACHE_HOME:-$HOME/.cache}/p10k-instant-prompt-${(%):-%n}.zsh"
fi

### zi 安装-开始
if [[ ! -f $HOME/.zi/bin/zi.zsh ]]; then
  print -P "%F{33}▓▒░ %F{160}Installing (%F{33}z-shell/zi%F{160})…%f"
  command mkdir -p "$HOME/.zi" && command chmod go-rwX "$HOME/.zi"
  command git clone -q --depth=1 --branch "main" https://hub.scgit.top/z-shell/zi "$HOME/.zi/bin" && \
    print -P "%F{33}▓▒░ %F{34}Installation successful.%f%b" || \
    print -P "%F{160}▓▒░ The clone has failed.%f%b"
fi
### zi 安装-结束
### zi 启用-开始
source "$HOME/.zi/bin/zi.zsh"
autoload -Uz _zi
(( ${+_comps} )) && _comps[zi]=_zi
# examples here -> https://wiki.zshell.dev/ecosystem/category/-annexes
zicompinit # <- https://wiki.zshell.dev/docs/guides/commands
### zi 启用-结束

DISABLE_MAGIC_FUNCTIONS=true
setopt nonomatch

# PATH
export PATH=$PATH:$HOME/.local/bin
export PATH="$PATH:/home/peach0x33a/bin"
export PATH="$PATH:~/go/bin"

# 常用愿望一次满足
# z-a-meta-plugins 可以为你提供一些打包好的插件
# https://wiki.zshell.dev/ecosystem/annexes/meta-plugins
zi light-mode for \
    depth=1 \
    from"hub.scgit.top" \
    z-shell/z-a-meta-plugins \
    from"hub.scgit.top" \
    z-shell/z-a-default-ice \
    from"hub.scgit.top" \
    z-shell/z-a-unscope \
    from"hub.scgit.top" \
    atinit'Z_A_USECOMP=1' \
    z-shell/z-a-eval \
    from"hub.scgit.top" \
    z-shell/z-a-linkbin

# 设置一些默认参数
zi default-ice -q lucid depth=1 from"hub.scgit.top"

# F-Sy-H 单独加载
zi light-mode for \
    @annexes+ \
    @zunit \
    @romkatv

# 装完重置屌
zi default-ice -cq

#禁用转义
export DISABLE_MAGIC_FUNCTIONS=true

# 加载环境变量
if [[ -r "${XDG_CACHE_HOME:-$HOME}/.env.zsh" ]]; then
    source "${XDG_CACHE_HOME:-$HOME}/.env.zsh"
fi

# LS COLORS
export LS_COLORS="ln=0;38;2;249;38;114:bd=0;38;2;102;217;239;48;2;51;51;51:cd=0;38;2;249;38;114;48;2;51;51;51:no=0:pi=0;38;2;0;0;0;48;2;102;217;239:mi=0;38;2;0;0;0;48;2;255;74;68:tw=0:st=0:fi=0:so=0;38;2;0;0;0;48;2;249;38;114:ex=1;38;2;249;38;114:*~=0;38;2;122;112;112:di=0;38;2;102;217;239:or=0;38;2;0;0;0;48;2;255;74;68:ow=0:*.z=4;38;2;95;190;0:*.h=0;38;2;166;226;46:*.c=0;38;2;166;226;46:*.p=0;38;2;166;226;46:*.t=0;38;2;166;226;46:*.o=0;38;2;122;112;112:*.a=1;38;2;249;38;114:*.d=0;38;2;166;226;46:*.r=0;38;2;166;226;46:*.m=0;38;2;166;226;46:*.cp=0;38;2;166;226;46:*.js=0;38;2;166;226;46:*.ll=0;38;2;166;226;46:*.nb=0;38;2;166;226;46:*.cs=0;38;2;166;226;46:*.rb=0;38;2;166;226;46:*.ml=0;38;2;166;226;46:*.rm=0;38;2;253;151;31:*.el=0;38;2;166;226;46:*.md=0;38;2;226;209;57:*.bz=4;38;2;95;190;0:*.cc=0;38;2;166;226;46:*.go=0;38;2;166;226;46:*.vb=0;38;2;166;226;46:*.ko=1;38;2;249;38;114:*.py=0;38;2;166;226;46:*.di=0;38;2;166;226;46:*.ts=0;38;2;166;226;46:*.ui=0;38;2;166;226;46:*.hh=0;38;2;166;226;46:*.xz=4;38;2;95;190;0:*.hi=0;38;2;122;112;112:*.7z=4;38;2;95;190;0:*.lo=0;38;2;122;112;112:*.gv=0;38;2;166;226;46:*.pl=0;38;2;166;226;46:*.jl=0;38;2;166;226;46:*.cr=0;38;2;166;226;46:*.as=0;38;2;166;226;46:*.bc=0;38;2;122;112;112:*.gz=4;38;2;95;190;0:*.pm=0;38;2;166;226;46:*.pp=0;38;2;166;226;46:*.rs=0;38;2;166;226;46:*.fs=0;38;2;166;226;46:*.mn=0;38;2;166;226;46:*.ps=0;38;2;230;219;116:*.hs=0;38;2;166;226;46:*.so=1;38;2;249;38;114:*.kt=0;38;2;166;226;46:*.sh=0;38;2;166;226;46:*.la=0;38;2;122;112;112:*.ex=0;38;2;166;226;46:*.td=0;38;2;166;226;46:*css=0;38;2;166;226;46:*.toc=0;38;2;122;112;112:*.htm=0;38;2;226;209;57:*.bz2=4;38;2;95;190;0:*.out=0;38;2;122;112;112:*.tmp=0;38;2;122;112;112:*.lua=0;38;2;166;226;46:*.aux=0;38;2;122;112;112:*.sbt=0;38;2;166;226;46:*.zsh=0;38;2;166;226;46:*hgrc=0;38;2;166;226;46:*.bag=4;38;2;95;190;0:*.rst=0;38;2;226;209;57:*.mli=0;38;2;166;226;46:*.dll=1;38;2;249;38;114:*.tgz=4;38;2;95;190;0:*.kex=0;38;2;230;219;116:*.sxi=0;38;2;230;219;116:*.rar=4;38;2;95;190;0:*.pps=0;38;2;230;219;116:*.mir=0;38;2;166;226;46:*TODO=1:*.wav=0;38;2;253;151;31:*.cfg=0;38;2;166;226;46:*.bmp=0;38;2;253;151;31:*.xlr=0;38;2;230;219;116:*.pro=0;38;2;166;226;46:*.pgm=0;38;2;253;151;31:*.ilg=0;38;2;122;112;112:*.blg=0;38;2;122;112;112:*.pbm=0;38;2;253;151;31:*.odt=0;38;2;230;219;116:*.sxw=0;38;2;230;219;116:*.jpg=0;38;2;253;151;31:*.h++=0;38;2;166;226;46:*.dpr=0;38;2;166;226;46:*.pkg=4;38;2;95;190;0:*.exe=1;38;2;249;38;114:*.asa=0;38;2;166;226;46:*.rtf=0;38;2;230;219;116:*.php=0;38;2;166;226;46:*.doc=0;38;2;230;219;116:*.exs=0;38;2;166;226;46:*.pas=0;38;2;166;226;46:*.tif=0;38;2;253;151;31:*.sql=0;38;2;166;226;46:*.mkv=0;38;2;253;151;31:*.bin=4;38;2;95;190;0:*.ind=0;38;2;122;112;112:*.elm=0;38;2;166;226;46:*.mid=0;38;2;253;151;31:*.psd=0;38;2;253;151;31:*.log=0;38;2;122;112;112:*.htc=0;38;2;166;226;46:*.ods=0;38;2;230;219;116:*.vcd=4;38;2;95;190;0:*.git=0;38;2;122;112;112:*.iso=4;38;2;95;190;0:*.hpp=0;38;2;166;226;46:*.m4a=0;38;2;253;151;31:*.otf=0;38;2;253;151;31:*.mpg=0;38;2;253;151;31:*.tml=0;38;2;166;226;46:*.mp4=0;38;2;253;151;31:*.awk=0;38;2;166;226;46:*.fsi=0;38;2;166;226;46:*.bbl=0;38;2;122;112;112:*.fsx=0;38;2;166;226;46:*.fnt=0;38;2;253;151;31:*.def=0;38;2;166;226;46:*.cpp=0;38;2;166;226;46:*.eps=0;38;2;253;151;31:*.pod=0;38;2;166;226;46:*.txt=0;38;2;226;209;57:*.xml=0;38;2;226;209;57:*.bst=0;38;2;166;226;46:*.ics=0;38;2;230;219;116:*.apk=4;38;2;95;190;0:*.bat=1;38;2;249;38;114:*.tcl=0;38;2;166;226;46:*.ps1=0;38;2;166;226;46:*.arj=4;38;2;95;190;0:*.zip=4;38;2;95;190;0:*.csv=0;38;2;226;209;57:*.aif=0;38;2;253;151;31:*.ppt=0;38;2;230;219;116:*.flv=0;38;2;253;151;31:*.xcf=0;38;2;253;151;31:*.pdf=0;38;2;230;219;116:*.dmg=4;38;2;95;190;0:*.ttf=0;38;2;253;151;31:*.inl=0;38;2;166;226;46:*.xmp=0;38;2;166;226;46:*.gif=0;38;2;253;151;31:*.nix=0;38;2;166;226;46:*.bak=0;38;2;122;112;112:*.ltx=0;38;2;166;226;46:*.mp3=0;38;2;253;151;31:*.ico=0;38;2;253;151;31:*.epp=0;38;2;166;226;46:*.swp=0;38;2;122;112;112:*.vob=0;38;2;253;151;31:*.c++=0;38;2;166;226;46:*.dox=0;38;2;166;226;46:*.odp=0;38;2;230;219;116:*.png=0;38;2;253;151;31:*.bib=0;38;2;166;226;46:*.ini=0;38;2;166;226;46:*.img=4;38;2;95;190;0:*.cxx=0;38;2;166;226;46:*.svg=0;38;2;253;151;31:*.ogg=0;38;2;253;151;31:*.yml=0;38;2;166;226;46:*.pid=0;38;2;122;112;112:*.csx=0;38;2;166;226;46:*.ipp=0;38;2;166;226;46:*.tbz=4;38;2;95;190;0:*.idx=0;38;2;122;112;112:*.avi=0;38;2;253;151;31:*.gvy=0;38;2;166;226;46:*.deb=4;38;2;95;190;0:*.tsx=0;38;2;166;226;46:*.fon=0;38;2;253;151;31:*.sty=0;38;2;122;112;112:*.rpm=4;38;2;95;190;0:*.vim=0;38;2;166;226;46:*.ppm=0;38;2;253;151;31:*.xls=0;38;2;230;219;116:*.m4v=0;38;2;253;151;31:*.com=1;38;2;249;38;114:*.dot=0;38;2;166;226;46:*.pyc=0;38;2;122;112;112:*.tex=0;38;2;166;226;46:*.wma=0;38;2;253;151;31:*.bcf=0;38;2;122;112;112:*.fls=0;38;2;122;112;112:*.swf=0;38;2;253;151;31:*.cgi=0;38;2;166;226;46:*.tar=4;38;2;95;190;0:*.clj=0;38;2;166;226;46:*.wmv=0;38;2;253;151;31:*.mov=0;38;2;253;151;31:*.jar=4;38;2;95;190;0:*.hxx=0;38;2;166;226;46:*.erl=0;38;2;166;226;46:*.inc=0;38;2;166;226;46:*.kts=0;38;2;166;226;46:*.bsh=0;38;2;166;226;46:*.purs=0;38;2;166;226;46:*.jpeg=0;38;2;253;151;31:*.html=0;38;2;226;209;57:*.h264=0;38;2;253;151;31:*.diff=0;38;2;166;226;46:*.bash=0;38;2;166;226;46:*.tiff=0;38;2;253;151;31:*.make=0;38;2;166;226;46:*.conf=0;38;2;166;226;46:*.fish=0;38;2;166;226;46:*.yaml=0;38;2;166;226;46:*.psd1=0;38;2;166;226;46:*.rlib=0;38;2;122;112;112:*.pptx=0;38;2;230;219;116:*.toml=0;38;2;166;226;46:*.json=0;38;2;166;226;46:*.orig=0;38;2;122;112;112:*.tbz2=4;38;2;95;190;0:*.java=0;38;2;166;226;46:*.flac=0;38;2;253;151;31:*.less=0;38;2;166;226;46:*.lisp=0;38;2;166;226;46:*.mpeg=0;38;2;253;151;31:*.hgrc=0;38;2;166;226;46:*.epub=0;38;2;230;219;116:*.xlsx=0;38;2;230;219;116:*.lock=0;38;2;122;112;112:*.docx=0;38;2;230;219;116:*.psm1=0;38;2;166;226;46:*.dart=0;38;2;166;226;46:*.cmake=0;38;2;166;226;46:*.shtml=0;38;2;226;209;57:*.patch=0;38;2;166;226;46:*.class=0;38;2;122;112;112:*.dyn_o=0;38;2;122;112;112:*README=0;38;2;246;174;73:*shadow=0;38;2;166;226;46:*.ipynb=0;38;2;166;226;46:*.cache=0;38;2;122;112;112:*.toast=4;38;2;95;190;0:*.scala=0;38;2;166;226;46:*.swift=0;38;2;166;226;46:*passwd=0;38;2;166;226;46:*.xhtml=0;38;2;226;209;57:*.cabal=0;38;2;166;226;46:*.mdown=0;38;2;226;209;57:*TODO.md=1:*.ignore=0;38;2;166;226;46:*.dyn_hi=0;38;2;122;112;112:*.matlab=0;38;2;166;226;46:*.flake8=0;38;2;166;226;46:*.gradle=0;38;2;166;226;46:*.groovy=0;38;2;166;226;46:*LICENSE=0;38;2;182;182;182:*.config=0;38;2;166;226;46:*COPYING=0;38;2;182;182;182:*INSTALL=0;38;2;246;174;73:*setup.py=0;38;2;166;226;46:*.gemspec=0;38;2;166;226;46:*Makefile=0;38;2;166;226;46:*.desktop=0;38;2;166;226;46:*Doxyfile=0;38;2;166;226;46:*TODO.txt=1:*.rgignore=0;38;2;166;226;46:*.kdevelop=0;38;2;166;226;46:*COPYRIGHT=0;38;2;182;182;182:*.DS_Store=0;38;2;122;112;112:*.cmake.in=0;38;2;166;226;46:*.markdown=0;38;2;226;209;57:*configure=0;38;2;166;226;46:*README.md=0;38;2;246;174;73:*.fdignore=0;38;2;166;226;46:*SConscript=0;38;2;166;226;46:*.gitconfig=0;38;2;166;226;46:*Dockerfile=0;38;2;166;226;46:*.scons_opt=0;38;2;122;112;112:*INSTALL.md=0;38;2;246;174;73:*.localized=0;38;2;122;112;112:*SConstruct=0;38;2;166;226;46:*README.txt=0;38;2;246;174;73:*CODEOWNERS=0;38;2;166;226;46:*.gitignore=0;38;2;166;226;46:*MANIFEST.in=0;38;2;166;226;46:*.gitmodules=0;38;2;166;226;46:*.travis.yml=0;38;2;230;219;116:*Makefile.in=0;38;2;122;112;112:*LICENSE-MIT=0;38;2;182;182;182:*.synctex.gz=0;38;2;122;112;112:*INSTALL.txt=0;38;2;246;174;73:*Makefile.am=0;38;2;166;226;46:*configure.ac=0;38;2;166;226;46:*CONTRIBUTORS=0;38;2;246;174;73:*.applescript=0;38;2;166;226;46:*.fdb_latexmk=0;38;2;122;112;112:*appveyor.yml=0;38;2;230;219;116:*.clang-format=0;38;2;166;226;46:*LICENSE-APACHE=0;38;2;182;182;182:*.gitattributes=0;38;2;166;226;46:*CMakeCache.txt=0;38;2;122;112;112:*CMakeLists.txt=0;38;2;166;226;46:*CONTRIBUTORS.md=0;38;2;246;174;73:*CONTRIBUTORS.txt=0;38;2;246;174;73:*requirements.txt=0;38;2;166;226;46:*.sconsign.dblite=0;38;2;122;112;112:*package-lock.json=0;38;2;122;112;112:*.CFUserTextEncoding=0;38;2;122;112;112"

export PROTO_HOME="$HOME/.proto"
export PATH="$PROTO_HOME/shims:$PROTO_HOME/bin:$PATH"

# 轮到各种插件了
if [[ -r "${XDG_CACHE_HOME:-$HOME}/.zi-snippet-full.zsh" ]]; then
    zi ice id"gzz-snippet-full"
    zi ice atload'zicdreplay'
    zi snippet "${XDG_CACHE_HOME:-$HOME}/.zi-snippet-full.zsh"
fi

# 设置Docker套接字地址到PODMAN
export CONTAINER_HOST=unix:///run/podman/podman.sock
export DOCKER_HOST=${CONTAINER_HOST}

# To customize prompt, run `p10k configure` or edit ~/.p10k.zsh.
[[ ! -f ~/.p10k.zsh ]] || source ~/.p10k.zsh

#THIS MUST BE AT THE END OF THE FILE FOR SDKMAN TO WORK!!!
export SDKMAN_DIR="$HOME/.sdkman"
[[ -s "$HOME/.sdkman/bin/sdkman-init.sh" ]] && source "$HOME/.sdkman/bin/sdkman-init.sh"

eval "$(/home/linuxbrew/.linuxbrew/bin/brew shellenv)"

export NVM_DIR="$HOME/.nvm"
[ -s "$NVM_DIR/nvm.sh" ] && \. "$NVM_DIR/nvm.sh"  # This loads nvm
[ -s "$NVM_DIR/bash_completion" ] && \. "$NVM_DIR/bash_completion"  # This loads nvm bash_completion

___MY_VMOPTIONS_SHELL_FILE="${HOME}/.jetbrains.vmoptions.sh"; if [ -f "${___MY_VMOPTIONS_SHELL_FILE}" ]; then . "${___MY_VMOPTIONS_SHELL_FILE}"; fi


#export GOOGLE_CLOUD_PROJECT="project2-470516"

alias ssh="kitten ssh"
